eisup_2019_docmng_integration/src/AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций/ВзаиморасчетыСРаботникамиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСРаботникамиОрганизаций</name>
  <comment>(Регл)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыплаты</name>
    <type>
      <types>EnumRef.СпособыВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодВзаиморасчетов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ЗарплатаЗаМесяцОрганизаций/ЗарплатаЗаМесяцОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗарплатаЗаМесяцОрганизаций</name>
  <comment>(Регл)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодВзаиморасчетов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕДЕНИЯ В СВЯЗАННЫЕ РЕГИСТРЫ

Процедура СоздатьДвиженияПоЗарплатаЗаМесяцОрганизаций(Регистратор)
	
	ХарактерВыплатыПоРегистратору = ЗарплатаКВыплатеОрганизацийПереопределяемый.ХарактерВыплатыПоДокументу(Регистратор);
	
	НаборЗаписейЗарплатаЗаМесяц = РегистрыНакопления.ЗарплатаЗаМесяцОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписейЗарплатаЗаМесяц.Отбор.Регистратор.Установить(Отбор.Регистратор.Значение);
	
	НаборЗаписейЗарплатаЗаМесяц.Загрузить(Выгрузить());
	Для Каждого Запись Из НаборЗаписейЗарплатаЗаМесяц Цикл
		Запись.ПериодВзаиморасчетов = НачалоМесяца(Запись.ПериодВзаиморасчетов);
		Если НЕ ЗначениеЗаполнено(Запись.ХарактерВыплаты) И ЗначениеЗаполнено(ХарактерВыплатыПоРегистратору) Тогда
			Запись.ХарактерВыплаты = ХарактерВыплатыПоРегистратору;
		КонецЕсли;
	КонецЦикла;	
	НаборЗаписейЗарплатаЗаМесяц.Записать();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

	Регистратор = Отбор.Регистратор.Значение;
	Если Регистратор.Метаданные().Движения.Содержит(Метаданные.РегистрыНакопления.ЗарплатаЗаМесяцОрганизаций) Тогда
		СоздатьДвиженияПоЗарплатаЗаМесяцОрганизаций(Регистратор);	
	КонецЕсли;
	
КонецПроцедуры
